Revit 2024 API
BuiltInFailures.MEPCalculationFailures.InvalidNumberOfMechanicalEquipmentOnDuty Property
 The number of on duty equipment must be less than or equal to the number of available equipments.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidNumberOfMechanicalEquipmentOnDuty { get; }
Visual Basic
Public Shared ReadOnly Property InvalidNumberOfMechanicalEquipmentOnDuty As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidNumberOfMechanicalEquipmentOnDuty {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace